benchmark/nginx/wrk_nginx.txt
Running 30s test @ http://127.0.0.1:8080/httptest/wikipedia_russia.html
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.82ms    3.17ms  49.15ms   71.41%
    Req/Sec   219.95     15.53   260.00     70.67%
  Latency Distribution
     50%   22.52ms
     75%   24.59ms
     90%   26.85ms
     99%   31.89ms
  13141 requests in 30.00s, 11.76GB read
Requests/sec:    438.03
Transfer/sec:    401.35MB